In [4]:
# Dependencies and Setup
import pandas as pd
import numpy as np

In [5]:
# Raw data file
file_to_load = r"C:\Users\ibilo\Desktop\homework\pandas homework\purchase_data.csv"

In [78]:
#read purchasing file and store into pandas data frame
purchase_data = pd.read_csv(file_to_load)

In [8]:
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [9]:
purchase_data.describe()

       Purchase ID         Age     Item ID       Price
count   780.000000  780.000000  780.000000  780.000000
mean    389.500000   22.714103   92.114103    3.050987
std     225.310896    6.659444   52.775943    1.169549
min       0.000000    7.000000    0.000000    1.000000
25%     194.750000   20.000000   48.000000    1.980000
50%     389.500000   22.000000   93.000000    3.150000
75%     584.250000   25.000000  139.000000    4.080000
max     779.000000   45.000000  183.000000    4.990000

In [61]:
purchase_data.columns

Index(['Purchase ID', 'SN', 'Age', 'Gender', 'Item ID', 'Item Name', 'Price'], dtype='object')

In [149]:
total_players = purchase_data["SN"].nunique()
total_players
#total_players_df = pd.DataFrame({
#    "Total Players": "total_players"
#})

576

In [28]:
#total players
num_unique_items = purchase_data["Item ID"].nunique()
num_unique_items

183

In [17]:
avg_price = purchase_data["Price"].mean()
avg_price

3.050987179487176

In [19]:
#number of purchase
num_purchase = purchase_data["Purchase ID"].count()
num_purchase

780

In [20]:
#total revenue
total_purchase = purchase_data["Price"].sum()
total_purchase

2379.77

In [29]:
#purchase analysis
purchase_analysis_df = pd.DataFrame({
    "Number of Unique Items": [num_unique_items],
    "Average Price": [avg_price],
    "Number of Purchases": [num_purchase],
    "Total Revenue": [total_purchase],
})
purchase_analysis_df["Average Price"] = purchase_analysis_df["Average Price"].map("${:,.2f}".format)
purchase_analysis_df["Total Revenue"] = purchase_analysis_df["Total Revenue"].map("${:,.2f}".format)
purchase_analysis_df

   Number of Unique Items Average Price  Number of Purchases Total Revenue
0                     183         $3.05                  780     $2,379.77

In [30]:
#organized_df = purchase_analysis_df[["Number of Unique Items", "Average Price", "Number of Purchases", "Total Revenue"]]

In [31]:
#gender demographics
gender_count = purchase_data["Gender"]
gender_count

0                       Male
1                       Male
2                       Male
3                       Male
4                       Male
5                       Male
6                       Male
7                       Male
8                       Male
9      Other / Non-Disclosed
10                      Male
11                      Male
12                      Male
13                      Male
14                      Male
15                    Female
16                      Male
17                      Male
18                    Female
19                      Male
20                      Male
21                      Male
22     Other / Non-Disclosed
23                      Male
24                      Male
25                      Male
26                      Male
27                      Male
28                      Male
29                      Male
               ...
750                     Male
751                     Male
752                     Male
753                     Male
754                   Female
755                     Male
756                     Male
757                     Male
758                     Male
759                     Male
760                     Male
761                     Male
762                     Male
763                     Male
764                     Male
765                     Male
766                     Male
767                   Female
768                     Male
769                     Male
770                     Male
771                     Male
772                     Male
773                     Male
774                     Male
775                   Female
776                     Male
777                     Male
778                     Male
779                     Male
Name: Gender, Length: 780, dtype: object

In [34]:
gender_count1 = gender_count.value_counts()
gender_count1

Male                     652
Female                   113
Other / Non-Disclosed     15
Name: Gender, dtype: int64

In [35]:
gender_count1 / avg_price

Male                     213.701324
Female                    37.037193
Other / Non-Disclosed      4.916442
Name: Gender, dtype: float64

In [38]:
gender_count1 / num_purchase

Male                     0.835897
Female                   0.144872
Other / Non-Disclosed    0.019231
Name: Gender, dtype: float64

In [44]:
gender_count_df = pd.DataFrame(gender_count.value_counts())
gender_count_df = gender_count_df.rename(
    columns = {"Gender": "Total Count"})
gender_count_df

                       Total Count
Male                           652
Female                         113
Other / Non-Disclosed           15

In [45]:
purchase_data.loc[purchase_data["Gender"] == "Male"].count()

Purchase ID    652
SN             652
Age            652
Gender         652
Item ID        652
Item Name      652
Price          652
dtype: int64

In [47]:
total_count = purchase_data.count()
total_count

Purchase ID    780
SN             780
Age            780
Gender         780
Item ID        780
Item Name      780
Price          780
dtype: int64

In [51]:
percent_gender = gender_count.value_counts() / gender_count.count()
percent_gender

Male                     0.835897
Female                   0.144872
Other / Non-Disclosed    0.019231
Name: Gender, dtype: float64

In [53]:
percent_gender = gender_count.value_counts() / gender_count.count()
percent_gender = percent_gender.map("{:,.2%}".format)
percent_gender

Male                     83.59%
Female                   14.49%
Other / Non-Disclosed     1.92%
Name: Gender, dtype: object

In [54]:
percent_gender_df = pd.DataFrame(percent_gender)
percent_gender_df.head()

                       Gender
Male                   83.59%
Female                 14.49%
Other / Non-Disclosed   1.92%

In [55]:
percent_gender_df = percent_gender_df.rename(
    columns = {"Gender": "percentage of players"})
percent_gender_df
percent_gender_df.reset_index().head()

                   index percentage of players
0                   Male                83.59%
1                 Female                14.49%
2  Other / Non-Disclosed                 1.92%

In [57]:
gender_count_df.reset_index().head()

                   index  Total Count
0                   Male          652
1                 Female          113
2  Other / Non-Disclosed           15

In [58]:
gender_count_df.columns

Index(['Total Count'], dtype='object')

In [59]:
gender_demographics_df = pd.DataFrame({
    "percentage of players": percent_gender,
    "Total Count": gender_count1,
})
gender_demographics_df.reset_index()
gender_demographics_df.head()

                      percentage of players  Total Count
Male                                 83.59%          652
Female                               14.49%          113
Other / Non-Disclosed                 1.92%           15

#be sure to review everything above before you proceed to the cells below.

In [65]:
#create bins and bin labels
#establish bins for ages 
age_bins = [0, 9.90, 14.90, 19.90, 24.90, 29.90, 34.90, 39.90, 99999]
group_names = ["<19", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]
age_bin = pd.cut(purchase_data ["Age"], age_bins, labels=group_names)
age_bin

0      20-24
1        40+
2      20-24
3      20-24
4      20-24
5      20-24
6      35-39
7      20-24
8      20-24
9      35-39
10     20-24
11     20-24
12     20-24
13     20-24
14     35-39
15     20-24
16     20-24
17     20-24
18     20-24
19     30-34
20     20-24
21     20-24
22     35-39
23       40+
24     30-34
25     25-29
26     10-14
27       <19
28     20-24
29     20-24
       ...
750    20-24
751    10-14
752    15-19
753    35-39
754    20-24
755    10-14
756    20-24
757    15-19
758    20-24
759    25-29
760    20-24
761      40+
762    25-29
763    20-24
764    15-19
765    15-19
766    20-24
767      <19
768    35-39
769    15-19
770    30-34
771    15-19
772    25-29
773    20-24
774    10-14
775    20-24
776    20-24
777    20-24
778      <19
779    20-24
Name: Age, Length: 780, dtype: category
Categories (8, object): [<19 < 10-14 < 15-19 < 20-24 < 25-29 < 30-34 < 35-39 < 40+]

In [79]:
#reload the ptchase data at the top to not get an error
purchase_data["Age"] = pd.cut(purchase_data ["Age"], age_bins, labels=group_names)
purchase_data

purchase_data["Age"].value_counts()

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<19       23
40+       13
Name: Age, dtype: int64

In [81]:
bins_total_count = purchase_data["Age"].value_counts()
bins_total_count

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<19       23
40+       13
Name: Age, dtype: int64

In [85]:
bins_percent = bins_total_count / total_players
bins_percent = bins_percent.map("{:,.2%}".format)
bins_percent

20-24    63.37%
15-19    23.61%
25-29    17.53%
30-34    12.67%
35-39     7.12%
10-14     4.86%
<19       3.99%
40+       2.26%
Name: Age, dtype: object

In [87]:
age_bins_df = pd.DataFrame({
    "Percentage of Players": bins_percent,
    "Total Count": bins_total_count,
})
age_bins_df

      Percentage of Players  Total Count
20-24                63.37%          365
15-19                23.61%          136
25-29                17.53%          101
30-34                12.67%           73
35-39                 7.12%           41
10-14                 4.86%           28
<19                   3.99%           23
40+                   2.26%           13

#purchasing analysis Age

In [92]:
purchase_data1 = purchase_data
purchase_data1.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20-24,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40+,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,20-24,Male,92,Final Critic,4.88
3,3,Chamassasya86,20-24,Male,100,Blindscythe,3.27
4,4,Iskosia90,20-24,Male,131,Fury,1.44

In [94]:
grouped_avg_purchase = purchase_data1.groupby(["Age"])
grouped_avg_purchase1 = grouped_avg_purchase["Price"].mean()
grouped_avg_purchase1

Age
<19      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.052219
25-29    2.900990
30-34    2.931507
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [115]:
bins_total_count = purchase_data["Age"].value_counts()
bins_total_count

20-24    365
15-19    136
25-29    101
30-34     73
35-39     41
10-14     28
<19       23
40+       13
Name: Age, dtype: int64

In [116]:
bins_percent = bins_total_count / total_players
bins_percent

20-24    0.633681
15-19    0.236111
25-29    0.175347
30-34    0.126736
35-39    0.071181
10-14    0.048611
<19      0.039931
40+      0.022569
Name: Age, dtype: float64

In [124]:
age_bins_df = pd.DataFrame({
    "Percentage of Players": bins_percent,
    "Total Count": bins_total_count,
})
age_bins_df["Percentage of Players"] = age_bins_df["Percentage of Players"].map("{:,.2%}".format)
age_bins_df

      Percentage of Players  Total Count
20-24                63.37%          365
15-19                23.61%          136
25-29                17.53%          101
30-34                12.67%           73
35-39                 7.12%           41
10-14                 4.86%           28
<19                   3.99%           23
40+                   2.26%           13

In [128]:
#Top spenders
grouped_purchase_by_name = purchase_data.groupby(["SN"])
grouped_purchase_by_name_sum = grouped_purchase_by_name["Price"].sum()
grouped_purchase_by_name_sum

SN
Adairialis76       2.28
Adastirin33        4.48
Aeda94             4.91
Aela59             4.32
Aelaria33          1.79
Aelastirin39       7.29
Aelidru27          1.09
Aelin32            8.98
Aelly27            6.79
Aellynun67         3.74
Aellyria80         3.08
Aelollo59          5.63
Aenarap34          2.96
Aeral43            4.40
Aeral68            4.00
Aeral97            4.80
Aeralria27         4.09
Aeralstical35      2.96
Aeri84             1.61
Aerillorin70       3.33
Aerithllora36      8.64
Aerithnucal56      4.40
Aerithnuphos61     4.91
Aerithriaphos45    1.56
Aerithriaphos46    2.18
Aesri53            1.76
Aesty53            3.91
Aestysu37          5.38
Aesur96            2.21
Aesurstilis64      1.03
                   ...
Undosia27          3.77
Undosian34         8.30
Undotesta33        4.74
Wailin72           2.73
Yadacal26          6.54
Yadaisuir65        4.09
Yadam35            2.48
Yadanu52           2.38
Yadaphos40         5.35
Yalae81            6.69
Yalaeria91         1.06
Yaliru88           3.03
Yalo85             3.65
Yalostiphos68      4.40
Yana46             3.55
Yarithllodeu72     3.75
Yarithrgue83       3.45
Yarithrin84        4.14
Yarithsurgue62     4.94
Yarolwen77         4.43
Yasrisu92          3.44
Yastyriaphos75     4.75
Yasur35            4.48
Yasur85            1.10
Yathecal72         3.46
Yathecal82         6.22
Yathedeu43         6.02
Yoishirrala98      4.58
Zhisrisu83         7.89
Zontibe81          8.03
Name: Price, Length: 576, dtype: float64

In [135]:
grouped_purchase_by_name_sum_df = pd.DataFrame({
    "Grouped Prices": grouped_purchase_by_name_sum
})
sorted_grouped_purchase_by_name_sum = grouped_purchase_by_name_sum_df.sort_values(by = "Grouped Prices", ascending=False)
sorted_grouped_purchase_by_name_sum.head()

             Grouped Prices
SN
Lisosia93             18.96
Idastidru52           15.45
Chamjask73            13.83
Iral74                13.62
Iskadarya95           13.10

In [ ]:
#convert the df to a series
sorted_grouped_purchase_by_name_sum

In [137]:
#get the name count
name_count = purchase_data["SN"].value_counts()
name_count

Lisosia93         5
Iral74            4
Idastidru52       4
Siallylis44       3
Inguron55         3
Chamimla85        3
Iskadarya95       3
Chadolyla44       3
Idai61            3
Chamjask73        3
Aina42            3
Tyidaim51         3
Ilarin91          3
Chanastnya43      3
Saedaiphos46      3
Rarallo90         3
Hada39            3
Tyisur83          3
Aelin32           3
Strithenu87       3
Raesty92          3
Yathecal82        3
Silaera56         3
Phyali88          3
Ialallo29         3
Umolrian85        3
Lisopela58        3
Haillyrgue51      3
Iri67             3
Zontibe81         3
                 ..
Aelidru27         1
Iadueria43        1
Tyeoralru41       1
Frichossala54     1
Phiristi62        1
Tyaelly53         1
Tyaelistidru84    1
Eosrirgue62       1
Irillo49          1
Aisur51           1
Maradarnya40      1
Isursti83         1
Ili43             1
Sisur91           1
Firatan58         1
Chadjask85        1
Jiskjask80        1
Lirtilsa71        1
Iskim96           1
Palyon91          1
Marirrasta50      1
Layjask75         1
Aeralria27        1
Undotesta33       1
Lisico81          1
Sondassasya91     1
Ina92             1
Idaisuir85        1
Aethedru70        1
Aidai73           1
Name: SN, Length: 576, dtype: int64

In [139]:
total_value = purchase_data["Price"].sum
total_value

<bound method Series.sum of 0      3.53
1      1.56
2      4.88
3      3.27
4      1.44
5      3.61
6      2.18
7      2.67
8      1.10
9      3.58
10     4.74
11     2.67
12     4.18
13     1.70
14     4.86
15     2.89
16     2.52
17     1.76
18     4.90
19     4.64
20     4.60
21     1.48
22     3.81
23     3.40
24     3.19
25     4.23
26     1.61
27     3.09
28     4.32
29     3.16
       ...
750    3.61
751    3.36
752    2.60
753    4.23
754    4.05
755    3.15
756    2.05
757    4.60
758    4.03
759    3.77
760    2.38
761    1.70
762    1.44
763    1.75
764    4.07
765    2.07
766    4.14
767    4.88
768    4.88
769    4.58
770    1.02
771    4.35
772    3.58
773    1.02
774    4.19
775    3.54
776    1.63
777    3.46
778    4.19
779    4.60
Name: Price, Length: 780, dtype: float64>

In [140]:
total_avg = purchase_data["Price"].mean()
total_avg

3.050987179487176